{
  "gryffindor": "The Gryffindor house emphasises the traits of courage as well as \"daring, nerve, and chivalry,\" and thus its members are generally regarded as brave, though sometimes to the point of recklessness. Some Gryffindors have also been noted to be short-tempered. Notably, Gryffindor house contributed many members to Dumbledore's Army and the Order of the Phoenix, although this may have been because the main members made it a point not to associate with other houses. According to Phineas Nigellus Black, members of other houses, particularly Slytherin, sometimes feel that Gryffindors engage in \"pointless heroics.\" Another Slytherin, Severus Snape, considered many Gryffindors to be self-righteous and arrogant, with no regard for rule",
  "slytherin": "Slytherins tend to be ambitious, shrewd, cunning, strong leaders, and achievement-oriented. They also have highly developed senses of self-preservation. This means that Slytherins tend to hesitate before acting, so as to weigh all possible outcomes before deciding exactly what should be done. According to Albus Dumbledore, the qualities which Salazar valued in the students he had chosen included cleverness, resourcefulness, determination, and \"a certain disregard for the rules.\" Dumbledore noted that all of these were qualities possessed by Harry Potter, who was in Gryffindor but almost placed in Slytherin. Slytherins tend to take charge and possess strong leadership skills. They are often self-assured and confident of their own competence and can be very loyal. Another characteristic some Slytherins share is a tendency towards deep, unrequited love. Severus Snape and The Bloody Baron held abiding but unreturned feelings for Lily Evans and Helena Ravenclaw, respectively. Although some Slytherins, such as Tom Riddle, were incapable of feeling love at all, those that did were known to cherish their passion abidingly and unconditionally, although often tragically due to an inability to act appropriately on their feelings. Interestingly, Bellatrix Lestrange held feelings for Tom Riddle himself, which was a factor in her fanatical devotion to the Death Eaters; although Lord Voldemort was incapable of loving her in return, the existence of Delphini suggests that there was at least some kind of intimacy between them. Although Merope Riddle likely never attended Hogwarts and therefore wouldn't have been sorted into Slytherin at all, she was a descendant of Slytherin himself and fit the pattern of those sorted into his house, as she held deep and unreturned feelings for Tom Riddle Snr, who often travelled by her house on his carriage.",
  "hufflepuff": "Students belonging to this house are known to be hard-working, friendly, loyal, honest and rather impartial. It may be that due to their values, Hufflepuffs are not as competitive as the other houses, and are more modest about their accomplishments. Hufflepuff is the most inclusive among the four houses; valuing hard work, dedication, patience, loyalty, and fair play rather than a particular aptitude in its students. Hufflepuffs are known to have a strong moral code, and a sense of right and wrong. Hufflepuffs are usually accepting of everyone. Students in Hufflepuff are known to value everyone and treat them as equal. Hufflepuff appears to have the least rivalry with the other houses, except in Quidditch, although the Triwizard Tournament did temporarily put a great deal of strain on the relationship between Gryffindor and Hufflepuff, due to unusual circumstances of the selection of both Gryffindor student Harry Potter and Hufflepuff student Cedric Diggory as Champions. This was mended by 1998, where a majority of Hufflepuffs rose to defend Harry from Pansy Parkinson and later helped to defend Hogwarts.",
  "ravenclaw": "Ravenclaws possess the traits of cleverness, wisdom, wit, intellectual ability and creativity. According to Slytherin prefect Gemma Farley, Ravenclaws are so competitive when it comes to academic success that they are known to back stab each other, and likely other students, in order to get top marks. Many well-known inventors and innovators have come from Ravenclaw. Students in Ravenclaw are noted for their individuality and acceptance of people and things that others would consider weird, as well as their outstanding intelligence. They can also be quirky and possess unusual intellectual interests. While others may be inclined to shun and ridicule such people, Ravenclaws generally accept and celebrate these eccentrics. Though they are often called stuck up, that is not the case."
}
